duxinglang-1/nRF9160_test/E2_TEST/src/screen/screen.c
		LCD_MeasureString("DEEP_SLEEP:        ",&w,&h);
		x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
		y = 120;
		LCD_ShowString(x,y,"DEEP_SLEEP:        ");
		sprintf(tmpbuf, "%d (min)", deep_sleep);
		LCD_ShowString(x+12*FONT_SIZE_16/2, y, tmpbuf);

		LCD_MeasureString("LIGHT_SLEEP:        ",&w,&h);
		x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
		y = 140;
		LCD_ShowString(x,y,"LIGHT_SLEEP:        ");
		sprintf(tmpbuf, "%d (min)", light_sleep);
		LCD_ShowString(x+13*FONT_SIZE_16/2, y, tmpbuf);
		break;
		
	case SCREEN_ACTION_UPDATE:
		GetSleepTimeData(&deep_sleep, &light_sleep);
		LCD_SetFontSize(FONT_SIZE_16);
		LCD_MeasureString("TOTAL_SLEEP:        ",&w,&h);
		x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
		y = 100;
		LCD_ShowString(x,y,"TOTAL_SLEEP:        ");
		sprintf(tmpbuf, "%d (min)", deep_sleep+light_sleep);
		LCD_ShowString(x+13*FONT_SIZE_16/2, y, tmpbuf);

		LCD_MeasureString("DEEP_SLEEP:        ",&w,&h);
		x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
		y = 120;
		LCD_ShowString(x,y,"DEEP_SLEEP:        ");
		sprintf(tmpbuf, "%d (min)", deep_sleep);
		LCD_ShowString(x+12*FONT_SIZE_16/2, y, tmpbuf);

		LCD_MeasureString("LIGHT_SLEEP:        ",&w,&h);
		x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
		y = 140;
		LCD_ShowString(x,y,"LIGHT_SLEEP:        ");
		sprintf(tmpbuf, "%d (min)", light_sleep);
		LCD_ShowString(x+13*FONT_SIZE_16/2, y, tmpbuf);
		break;
	}
	
	scr_msg[SCREEN_ID_SLEEP].act = SCREEN_ACTION_NO;
}

void StepsScreenProcess(void)
{
	u16_t x,y,w,h;
	u16_t steps,calorie,distance;
	u8_t notify[64] = "Sport";
	u8_t tmpbuf[64] = {0};
	
	switch(scr_msg[SCREEN_ID_STEPS].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_STEPS].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_STEPS].status = SCREEN_STATUS_CREATED;
				
		LCD_Clear(BLACK);
		LCD_SetFontSize(FONT_SIZE_24);
		LCD_MeasureString(notify,&w,&h);
		x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
		y = 50;
		LCD_ShowString(x,y,notify);

		GetSportData(&steps, &calorie, &distance);
		LCD_SetFontSize(FONT_SIZE_16);
		
		LCD_MeasureString("Steps:     ",&w,&h);
		x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
		y = 100;
		LCD_ShowString(x, y, "Steps:     ");
		sprintf(tmpbuf, "%d", steps);
		LCD_ShowString(x+7*FONT_SIZE_16/2, y, tmpbuf);

		LCD_MeasureString("Distance:     ",&w,&h);
		x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
		y = 120;
		LCD_ShowString(x,y,"Distance:     ");
		sprintf(tmpbuf, "%d", distance);
		LCD_ShowString(x+10*FONT_SIZE_16/2, y, tmpbuf);

		LCD_MeasureString("Calorie:     ",&w,&h);
		x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
		y = 140;
		LCD_ShowString(x,y,"Calorie:     ");
		sprintf(tmpbuf, "%d", calorie);
		LCD_ShowString(x+9*FONT_SIZE_16/2, y, tmpbuf);		
		break;
		
	case SCREEN_ACTION_UPDATE:
		GetSportData(&steps, &calorie, &distance);
		LCD_SetFontSize(FONT_SIZE_16);
		
		LCD_MeasureString("Steps:     ",&w,&h);
		x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
		y = 100;
		LCD_ShowString(x, y, "Steps:     ");
		sprintf(tmpbuf, "%d", steps);
		LCD_ShowString(x+7*FONT_SIZE_16/2, y, tmpbuf);

		LCD_MeasureString("Distance:     ",&w,&h);
		x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
		y = 120;
		LCD_ShowString(x,y,"Distance:     ");
		sprintf(tmpbuf, "%d", distance);
		LCD_ShowString(x+10*FONT_SIZE_16/2, y, tmpbuf);

		LCD_MeasureString("Calorie:     ",&w,&h);
		x = (w > LCD_WIDTH)? 0 : (LCD_WIDTH-w)/2;
		y = 140;
		LCD_ShowString(x,y,"Calorie:     ");
		sprintf(tmpbuf, "%d", calorie);
		LCD_ShowString(x+9*FONT_SIZE_16/2, y, tmpbuf);
		break;
	}
	
	scr_msg[SCREEN_ID_STEPS].act = SCREEN_ACTION_NO;
}

void FallShowStatus(void)
{
#if 0
	u16_t x,y;
	u32_t img_addr;
	u8_t *img;

	LCD_Clear(BLACK);

	switch(global_settings.language)
	{
	case LANGUAGE_EN:
	#ifdef IMG_FONT_FROM_FLASH
		img_addr = IMG_FALL_EN_ADDR;
	#else
		img = IMG_FALL_EN;
	#endif
		x = FALL_EN_TEXT_X;
		y = FALL_CN_TEXT_Y;
		break;
		
	case LANGUAGE_CHN:
	#ifdef IMG_FONT_FROM_FLASH
		img_addr = IMG_FALL_CN_ADDR;
	#else
		img = IMG_FALL_CN;
	#endif
		x = FALL_CN_TEXT_X;
		y = FALL_CN_TEXT_Y;	
		break;
	}

#ifdef IMG_FONT_FROM_FLASH
	LCD_ShowImg_From_Flash(FALL_ICON_X, FALL_ICON_Y, IMG_FALL_ICON_ADDR);
	LCD_ShowImg_From_Flash(x, y, img_addr);
#else
	LCD_ShowImg(FALL_ICON_X, FALL_ICON_Y, IMG_FALL_ICON);
	LCD_ShowImg(x, y, img);
#endif
#endif
}

void FallScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_FALL].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_FALL].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_FALL].status = SCREEN_STATUS_CREATED;

		FallShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		break;
	}
	
	scr_msg[SCREEN_ID_FALL].act = SCREEN_ACTION_NO;
}
#endif

void WristShowStatus(void)
{
#if 0
	u16_t x,y;
	u32_t img_addr;
	u8_t *img;

	LCD_Clear(BLACK);

	switch(global_settings.language)
	{
	case LANGUAGE_EN:
	#ifdef IMG_FONT_FROM_FLASH
		img_addr = IMG_WRIST_EN_ADDR;
	#else
		img = IMG_WRIST_EN;
	#endif
		x = WRIST_EN_TEXT_X;
		y = WRIST_EN_TEXT_Y;
		break;
		
	case LANGUAGE_CHN:
	#ifdef IMG_FONT_FROM_FLASH
		img_addr = IMG_WRIST_CN_ADDR;
	#else
		img = IMG_WRIST_CN;
	#endif
		x = WRIST_CN_TEXT_X;
		y = WRIST_CN_TEXT_Y;	
		break;
	}

#ifdef IMG_FONT_FROM_FLASH
	LCD_ShowImg_From_Flash(FALL_ICON_X, FALL_ICON_Y, IMG_WRIST_ICON_ADDR);
	LCD_ShowImg_From_Flash(x, y, img_addr);
#else
	LCD_ShowImg(FALL_ICON_X, FALL_ICON_Y, IMG_WRIST_ICON);
	LCD_ShowImg(x, y, img);
#endif
#endif
}

void WristScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_WRIST].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_WRIST].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_WRIST].status = SCREEN_STATUS_CREATED;

		WristShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		break;
	}
	
	scr_msg[SCREEN_ID_WRIST].act = SCREEN_ACTION_NO;
}

void TestGPSUpdateInfor(void)
{
	LCD_Fill((LCD_WIDTH-194)/2, 50, 194, 160, BLACK);
	LCD_SetFontSize(FONT_SIZE_16);
	LCD_ShowStringInRect((LCD_WIDTH-192)/2, 50, 192, 160, gps_test_info);
}

void TestGPSShowInfor(void)
{
	u16_t x,y,w,h;
	u8_t strbuf[128] = {0};
	
	LCD_Clear(BLACK);
	strcpy(strbuf, "GPS TESTING");
	LCD_SetFontSize(FONT_SIZE_16);
	LCD_MeasureString(strbuf, &w, &h);
	LCD_ShowString((LCD_WIDTH-w)/2, 20, strbuf);
	LCD_ShowStringInRect((LCD_WIDTH-192)/2, 50, 192, 160, "GPS Starting...");
}

void TestGPSScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_GPS_TEST].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_GPS_TEST].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_GPS_TEST].status = SCREEN_STATUS_CREATED;

		TestGPSShowInfor();
		break;
		
